# 变量的替换
## 变量值的替换
* 定义：使用**指定字符（字符串）** 替换变量中的**后缀字符（字符串）**
* 语法：`$(var:a=b)`或`${var:a=b}`
也就是将后缀为a的变量变为后缀为b的变量
    * 替换表达式不能有任何空格
    * make中支持使用${}对变量进行取值
```makefile
src1 := a.cc b.cc c.cc
obj1 := $(src1:cc=o)

test1 :
	@echo "obj1 => $(obj1)"
```
输出
```shell
> make test1
obj1 => a.o b.o c.o
```
## 变量的模式替换
* 定义：**使用%保留变量值中的指定字符**，替换其他字符-->**除了%那段，%前后分别都要替换**
* 语法：`$(var:a%b=x%y)`或`${var:a%b=x%y}`
也就是将后缀为a的变量变为后缀为b的变量
    * 替换表达式不能有任何空格
    * make中支持使用${}对变量进行取值
```makefile
src2 := a11b.c a22b.c a33b.c
obj2 := $(src2:a%b.c=x%y)

test2 :
	@echo "obj2 => $(obj2)"
```
输出
```shell
> make test2
obj2 => x11y x22y x33y
```
## 规则中的模式替换
```makefile
targets:target-pattern:prereq-pattern
    command1
    command2
```
* 意义：通过`target-pattern`从`target`中匹配子目标；再通过`prereq-pattern`从子目标中生成依赖；构成完成的规则
```makefile
CC := gcc
TARGET := hello-makefile.out
OBJS := func.o main.o const.o

$(TARGET) : $(OBJS)
	$(CC) -o $@ $^
#这里就用到了模式替换---->可以理解成把.c替换成.o
$(OBJS) : %.o : %.c
	$(CC) -o $@ -c $^
#等价于
#func.o:func.c
#	gcc -o $@ -c $^ 
#main.o:main.c
#	gcc -o $@ -c $^ 
.PHONY : rebuild clean all

rebuild : clean all
all : $(TARGET)
clean :
	$(RM) *.o $(TARGET)
```
# 变量值的嵌套引用
* 一个变量名中可以包含对其他变量值的引用
    * 其实就本质而言：就是用一个变量表示另一变量
```makefile
x：=y
y:=z
a:=$(($(y)))
#a:=z
```
# 命令行变量
* 运行make时，在命令行定义的变量
* 命令行默认覆盖makefile中定义的变量
```makefile
hm:=hello makefile
test:
    @echo "hm => $(hm)"
```
输入
```shell
> make hm=wdnmd
hm => wdnmd
```
# override关键字
* 用于指示makefie中定义的变量不能被覆盖
* **变量的定义和赋值都有需要override关键字**
```makefile
override var := test
test:
    @echo "var => $(var)"
```
输入
```shell
> make hm=wdnmd
var => test
```
# define关键字
* 用于在makefile中定义多行变量
* 多行变量的定义从变量名开始到`endef`结束
* 可使用`override`关键字防止被覆盖
* `define`定义的变量**等价于**使用`=`定义变量
```makefile
hm := hello makefile

override var := override-test

define foo
I'm fool!
endef

override define cmd
	@echo "run cmd ls ..."
	@ls
endef
test :
	@echo "hm => $(hm)"
	@echo "var => $(var)"
	@echo "foo => $(foo)"
	${cmd}
```
输出
```shell
> make test
hm => hello makefile
var => override-test
foo => I'm fool!
run cmd ls ...
const.c  func.c  main.c  makefile  makefile.3  变量的高级技巧.md
```
# makefile中的三种变量
## 环境变量（全局变量）
* makefile 中能够直接使用环境变量的值
    * 如果定义了**同名变量**，环境变量将被覆盖
    * 运行make时指定`"-e"`选项，优先使用环境变量
  
环境变量的优点：可以在所有的makefile中使用

* 变量在不同makefile之间的传递方式
    * 直接在外部定义环境变量进行传递--->移植性低
    * 使用`export`定义变量进行传递（定义临时环境变量）
    * 定义make命令行变量进行传递
makefie:
```makefile
JAVA_HOME := java home
export var := D.T.Software
new := TDelphi

test :
	@echo "JAVA_HOME => $(JAVA_HOME)"
	@echo "make another file ..."
	@$(MAKE) -f makefile.2
	@$(MAKE) -f makefile.2 new:=$(new)
```
makefile.2:
```makefile
test:
	@echo "JAVA_HOME => $(JAVA_HOME)"
	@echo "var => $(var)"
	@echo "new => $(new)"
```
输出：
```shell
> make test
JAVA_HOME => java home
make another file ...
make[1]: Entering directory '/mnt/f/C学习/github同步的学习资料/C-basic/make_file/04_变量的高技巧'
JAVA_HOME =>
var => D.T.Software
new =>
make[1]: Leaving directory '/mnt/f/C学习/github同步的学习资料/C-basic/make_file/04_变量的高技巧'
make[1]: Entering directory '/mnt/f/C学习/github同步的学习资料/C-basic/make_file/04_变量的高技巧'
JAVA_HOME =>
var => D.T.Software
new => TDelphi
make[1]: Leaving directory '/mnt/f/C学习/github同步的学习资料/C-basic/make_file/04_变量的高技巧'
```

## 目标变量
* 作用域只在指定目标及连带规则中
    * `target: name <assignment> value`
    * `target: override name <assignment> value`
```makefile
var := FUFU
test : var :=test-var

#只在test中起作用
test :
	@echo "test:"
	@echo "var => $(var)"
```
输出
```shell
> make test
test:
var => test-var
```
## 模式变量（可以看作目标变量plus）
* 模式变量是目标变量的扩展
* 作用域只在符合**模式**的目标及其连带规则中
    * `pattern: name <assignment> value`
    * `pattern: override name <assignment> value`
```makefile
var := D.T.Software
new := TDelphi

test : var := test-var
%e : override new := test-new
#只要是以e结尾的都要执行override new := test-new
#一般模式变量都是要和override配合使用
test : another
	@echo "test :"
	@echo "var => $(var)"
	@echo "new => $(new)"
	
another :
	@echo "another :"
	@echo "var => $(var)"
	@echo "new => $(new)"
	
rule :
	@echo "rule :"
	@echo "var => $(var)"
	@echo "new => $(new)"
```
输出：
```shell
> make
another :
var => test-var
new => TDelphi
test :
var => test-var
new => TDelphi
```


