#include <stdio.h>
/***********面试题！！！*******************************/
//嵌入式必考！
/*****************************************/
//逻辑运算
//一段代码完成交换位置
#define SWAP1(a, b)    \
{                      \
    int t = a;         \
    a = b;             \
    b = t;             \
}//不行

#define SWAP2(a, b)    \
{                      \
    a = a + b;         \
    b = a - b;         \
    a = a - b;         \
}//只能不超过int的范围
//高端的交换位置
#define SWAP3(a, b)    \
{                      \
    a = a ^ b;         \
    b = a ^ b;         \
    a = a ^ b;         \
}//^异或
//b=(a^b)^b
//a=(a^b)^a
int main()
{
    int a = 1;
    int b = 2;
    int i = 0;
    int j = 0;
    int k = 0;
    printf("a = %d\n", a); //1
    printf("b = %d\n", b); //2
    SWAP3(a ,b);
    printf("a = %d\n", a); //2
    printf("b = %d\n", b); //1
    /************************************************************/
        //位运算没有短路规则，每一个都要参与计算
        if( ++i | ++j & ++k )//1
    {
        printf("Run here...\n");
    }
    /********************************************************/
    //<<高位丢弃，低位补0
    //>>正：高位补0 负:高补位1
    printf("%d\n", 3 << 2); //12
    printf("%d\n", 3 >> 1); //1
    printf("%d\n", -1 >> 1); //-1
    printf("%d\n", 0x01 << 2 + 3);//优先计算四则运算
    //优先级：四则运算>位运算>逻辑运算
    //printf("%d\n", 3 << -1); // oops!
    return 0;
}