#include <stdio.h>
/***************面试题！********************************/
//下面程序哪里有问题？
//临时对象的问题
//临时对象：生命作用域只有一条语句
//程序的意图为了代码复用
class Test {
    int mi;
    /***********修正**************************/
    //用别的函数替代构造函数
        void init(int i)
    {
        mi = i;
    }
    /***********修正**************************/
public:
    /*Test(int i) {
        mi = i;
    }
    Test() {
        //直接调用构造函数将产生临时对象
        //下面一句因为是临时对象等价与没有
        Test(0);
        //临时对象调用完后立马析构
    }
    */
   /***********修正**************************/
       Test(int i) {
        init(i);
    }
    Test() {
        init(0);
    }
   /***********修正**************************/
    void print() {
        printf("mi = %d\n", mi);
    }
};
int main()
{
    Test t;
    t.print();
    return 0;
}