#include <stdio.h>
#include <malloc.h>
#include <string.h>
//野指针的由来
//1.指向被销毁的变量
//2.使用已经释放的指针
//3.错误的指针运算
//4.错误的强制类型转换
int main()
{
    int* p1 = (int*)malloc(40);
    int* p2 = (int*)1234567;
    int i = 0;
    for(i=0; i<40; i++)
    {
        *(p1 + i) = 40 - i;
    }
    free(p1); 
    //不可调用已经释放的指针
    /*
    for(i=0; i<40; i++)
    {
        p1[i] = p2[i];
    }
    */
    return 0;
}
//避免野指针的基本原则
//1.绝不返回局部变量和局部数组地址
//2.任何变量在定以后必须初始化
//3.字符数组必须确认/0为结束符后才能成为字符串
//4.任何使用与内存操作相关的函数必须指定长度信息